; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-7-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-2 - location
	p2-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s0)
	(at driver6 s0)
	(at driver7 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s1)
	(at package2 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s1)
	(link s1 s2)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s1)
	(at driver6 s2)
	(at truck1 s1)
	(at truck5 s2)
	(at truck6 s0)
	(at truck7 s0)
	(at package1 s0)
	(at package2 s1)
	))


)

; plan
1. (walk driver5 s0 p0-1)
   deleted: (at driver5 s0)
   added: (at driver5 p0-1)
   goals met: 4 of 11
2. (walk driver5 p0-1 s1)
   deleted: (at driver5 p0-1)
   added: (at driver5 s1)
   goals met: 5 of 11
3. (load-truck package2 truck6 s2)
   deleted: (at package2 s2)
   added: (in package2 truck6)
   goals met: 5 of 11
4. (board-truck driver4 truck6 s2)
   deleted: (at driver4 s2) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 5 of 11
5. (drive-truck truck6 s2 s1 driver4)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   goals met: 5 of 11
6. (unload-truck package2 truck6 s1)
   deleted: (in package2 truck6)
   added: (at package2 s1)
   goals met: 6 of 11
7. (load-truck package1 truck6 s1)
   deleted: (at package1 s1)
   added: (in package1 truck6)
   goals met: 6 of 11
8. (drive-truck truck6 s1 s0 driver4)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 7 of 11
9. (disembark-truck driver4 truck6 s0)
   deleted: (driving driver4 truck6)
   added: (at driver4 s0) (empty truck6)
   goals met: 8 of 11
10. (board-truck driver2 truck7 s1)
   deleted: (at driver2 s1) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 8 of 11
11. (drive-truck truck7 s1 s0 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 9 of 11
12. (unload-truck package1 truck6 s0)
   deleted: (in package1 truck6)
   added: (at package1 s0)
   goals met: 10 of 11
13. (walk driver6 s0 p2-0)
   deleted: (at driver6 s0)
   added: (at driver6 p2-0)
   goals met: 10 of 11
14. (walk driver6 p2-0 s2)
   deleted: (at driver6 p2-0)
   added: (at driver6 s2)
   goals met: 11 of 11
